app/Filament/Resources/UserResource/Widgets/UserStatsWidget.php

    protected function getStats(): array
    {
        return [
            Stat::make("Total User", User::count())->color('success'),
            Stat::make("Total Admins", User::where('role', User::ROLE_ADMIN)->count()),
            Stat::make("Total Editors", User::where('role', User::ROLE_EDITOR)->count()),
---
select count(*) as aggregate from `users` where `role` = 'ADMIN'
select count(*) as aggregate from `users` where `role` = 'EDITOR'