app/Livewire/PostComments.php

    public function comments()
    {
        return $this?->post?->comments()->latest()->paginate(5);
---
select count(*) as aggregate from `comments` where `comments`.`post_id` = 23 and `comments`.`post_id` is not null