app/Http/Controllers/HomeController.php

    public function __invoke(Request $request)
    {
        $featuredPosts = Cache::remember('featuredPosts', now()->addDay(), function () {
            return Post::published()->featured()->with('categories')->latest('published_at')->take(3)->get();
        });

        $latestPosts = Cache::remember('latestPosts', now()->addDay(), function () {
            return Post::published()->with('categories')->latest('published_at')->take(9)->get();
---
select * from `posts` where `published_at` <= '2024-04-05 09:12:01' and `featured` = 1 and `posts`.`deleted_at` is null order by `published_at` desc limit 3
select `categories`.*, `category_post`.`post_id` as `pivot_post_id`, `category_post`.`category_id` as `pivot_category_id` from `categories` inner join `category_post` on `categories`.`id` = `category_post`.`category_id` where `category_post`.`post_id` in (2, 3, 8)
select * from `posts` where `published_at` <= '2024-04-05 09:12:01' and `posts`.`deleted_at` is null order by `published_at` desc limit 9
select `categories`.*, `category_post`.`post_id` as `pivot_post_id`, `category_post`.`category_id` as `pivot_category_id` from `categories` inner join `category_post` on `categories`.`id` = `category_post`.`category_id` where `category_post`.`post_id` in (2, 3, 5, 8, 11, 12, 13, 19, 23)